task/single-software/cli/openfoam/task-01/init_file/cavity_base/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    movingWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          64;
        startFace       8064;
    }
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          192;
        startFace       8128;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          8192;
        startFace       8320;
    }
)

// ************************************************************************* //
